<a href="https://colab.research.google.com/github/ShravantiHable/AA/blob/main/ADV_C194_3(Solution).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#Additional-Activty-3
#Get the total number of movies based on the coountries
#predefine code
import pandas as pd
import matplotlib.pyplot as plt
df = pd.read_csv('https://shravantihable.github.io/AA/movie_update.csv')
df
#predefine code end

#using the df.groupby() function, group the values of the 'Country' column to get the total movies based on the country, then add a column 'Title' inside the square brackets and apply the count function on it, and reset the index to 0 and store it in variable group_by_country.
group_by_country = df.groupby('Country')['Title'].count().reset_index()
#print the variable group_by_country
group_by_country
#then sort the values of the variable group_by_country using the sort_values()function, and inside the sort_values() add the parameter as by=['Title'] and followed by comma, add one more parameter as ascending=False, and store it in variable sorted_df
sorted_df = group_by_country.sort_values(by=['Title'], ascending = False)
#print the variable sorted_df
sorted_df

                                                Country  Title
1059                                      United States   8776
477                                               India   1064
908                                      United Kingdom    905
117                                              Canada    555
34                                            Australia    202
...                                                 ...    ...
507                                   Ireland,Australia      1
508    Ireland,Belgium,France,Luxembourg,United Kingdom      1
509                       Ireland,Belgium,United States      1
511   Ireland,Canada,Luxembourg,United States,United...      1
1302                                      Zambia,Sweden      1

[1303 rows x 2 columns]